<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"ace2c9d797457c1a2beca5ae122dc8517ce8e09e382da4ce504bffeb90c4be2a","plan_job_ref":"Job .github/workflows/_test-tf.yaml #211 at https://github.com/tx-pts-dai/github-workflows/actions/runs/11462227357","plan_out_hash":"e7d6b1292f95ae20477d55256bfa19051508d0c3362d4bbe459f12474ff6f0a3","plan_hash":"f8e461e3d17ebef4094ffb54ff7699e30736118ac64401e8cd791558bdc5629d","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #211](https://github.com/tx-pts-dai/github-workflows/actions/runs/11462227357)